tap "daipeihust/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "laishulu/homebrew"
tap "nikitabobko/tap"
tap "oven-sh/bun"
brew "xz"
brew "libtiff"
brew "openexr"
brew "aom"
brew "ca-certificates"
brew "openssl@3"
brew "libssh2"
brew "libgit2"
brew "bat"
brew "bottom"
brew "c-ares"
brew "glib"
brew "pixman"
brew "certifi"
brew "fribidi"
brew "harfbuzz"
brew "chafa"
brew "entr"
brew "eza"
brew "fd"
brew "fnm"
brew "fzf"
brew "git"
brew "git-delta"
brew "gitui"
brew "gnu-sed"
brew "sqlite"
brew "httpie"
brew "icu4c@75"
brew "icu4c@76"
brew "jq"
brew "lazygit"
brew "libnghttp2"
brew "libuv"
brew "libzip"
brew "llvm"
brew "lpeg"
brew "luajit"
brew "mercurial"
brew "tree-sitter"
brew "neovim"
brew "pkgconf"
brew "pnpm"
brew "procs"
brew "python-packaging"
brew "ripgrep"
brew "rust"
brew "rustup"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "unar"
brew "viu"
brew "zoxide"
brew "laishulu/homebrew/macism"
brew "oven-sh/bun/bun"
cask "aerospace"
cask "alacritty"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "raycast"
cask "switchkey"
vscode "alefragnani.project-manager"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.remotehub"
vscode "jasonnutter.search-node-modules"
vscode "leetcode.vscode-leetcode"
vscode "mrcrowl.easy-less"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-repositories"
vscode "quicktype.quicktype"
vscode "ryuta46.multi-command"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "steoates.autoimport"
vscode "vscodevim.vim"
vscode "vspacecode.whichkey"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
