tap "daipeihust/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "nikitabobko/tap"
tap "oven-sh/bun"
brew "bat"
brew "bottom"
brew "chafa"
brew "entr"
brew "eza"
brew "fd"
brew "fnm"
brew "fzf"
brew "git"
brew "git-delta"
brew "gitui"
brew "gnu-sed"
brew "httpie"
brew "jq"
brew "lazygit"
brew "neovim"
brew "node"
brew "pnpm"
brew "procs"
brew "ripgrep"
brew "tldr"
brew "tmux"
brew "viu"
brew "zoxide"
brew "oven-sh/bun/bun"
cask "aerospace"
cask "alacritty"
cask "font-hack-nerd-font"
cask "raycast"
vscode "alefragnani.project-manager"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.remotehub"
vscode "jasonnutter.search-node-modules"
vscode "leetcode.vscode-leetcode"
vscode "mrcrowl.easy-less"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-repositories"
vscode "quicktype.quicktype"
vscode "ryuta46.multi-command"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "steoates.autoimport"
vscode "vscodevim.vim"
vscode "vspacecode.whichkey"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
